In [1]:
import numpy as np
import pandas as pd

In [2]:
test = pd.read_csv('./titanic/test.csv')
train = pd.read_csv('./titanic/train.csv')
gender = pd.read_csv('./titanic/gender_submission.csv')

test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [3]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [56]:
train['Cabin'].str[:1].value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: Cabin, dtype: int64

In [57]:
train['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [58]:
train['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [59]:
print(type(train), train.shape)

<class 'pandas.core.frame.DataFrame'> (891, 12)

In [60]:
train['Age'].median()

28.0

In [61]:
train['Age'].fillna(train['Age'].median(), inplace=True)

train['Embarked'].fillna('S', inplace=True)


train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [62]:
test['Age'].fillna(test['Age'].median(), inplace=True)
test['Fare'].fillna(test['Fare'].median(), inplace=True)

test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [63]:
#test데이터의 정답을 추가

test['Survived'] = gender['Survived']

test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [83]:
test = test [ ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Embarked'] ]

test.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [94]:
train_data = train.values
test_data = test.values
test_sub = gender.values

print(type(train_data), train_data.shape)
print(type(test_data), test_data.shape)
print(type(test_sub), test_sub.shape)

<class 'numpy.ndarray'> (891, 12)
<class 'numpy.ndarray'> (418, 11)
<class 'numpy.ndarray'> (418, 2)

In [95]:
# train_csv_data 에서 male -> 1, female -> 0
for i in range(len(train_data)):
    
    if train_data[i, 4] == 'male':
        
        train_data[i, 4] = 1
    
    else:
        
        train_data[i, 4] = 0
        
# test_csv_data 에서 male -> 1, female -> 0
for i in range(len(test_data)):
    
    if test_data[i, 4] == 'male':
        
        test_data[i, 4] = 1
    
    else:
        
        test_data[i, 4] = 0

In [97]:
# train_csv_data 에서 Embarked, Empty -> 0, S -> 1, C -> 2, Q -> 3
for i in range(len(train_data)):
    
    if train_data[i, 11] == 'S':
        
        train_data[i, 11] = 1
        
    elif train_data[i, 11] == 'C':
        
        train_data[i, 11] = 2
        
    elif train_data[i, 11] == 'Q':
        
        train_data[i, 11] = 3
        

# test_csv_data 에서 Embarked, Empty -> 0, S -> 1, C -> 2, Q -> 3
for i in range(len(test_data)):
    
    if test_data[i, 10] == 'S':
        
        test_data[i, 10] = 1
        
    elif test_data[i, 10] == 'C':
        
        test_data[i, 10] = 2
        
    elif test_data[i, 10] == 'Q':
        
        test_data[i, 10] = 3

In [98]:
train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [99]:
test.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q

In [100]:
# test_input_data / test_target_data 생성

test_input_data = test_data[ : , [ 2, 4, 5, 6, 7, 9] ].astype('float32')  # Pclass, Sex, Age, SibSp, Parch, Fare
test_target_data = test_data[ :, 1 ].astype('float32')  # test_csv_sub 에서 데이터 가져옴. 주의 요함

print("test_input_data.shape = ", test_input_data.shape, ", test_target_data.shape = ", test_target_data.shape)

test_input_data.shape =  (418, 6) , test_target_data.shape =  (418,)

In [101]:
# train_input_data / train_target_data 생성

train_input_data = train_data[ : , [ 2, 4, 5, 6, 7, 9] ].astype('float32')  # Pclass, Sex, Age, SibSp, Parch, Fare
train_target_data = train_data[ :, 1 ].astype('float32')  # test_csv_sub 에서 데이터 가져옴. 주의 요함

print(train_input_data)
print("test_input_data.shape = ", test_input_data.shape, ", test_target_data.shape = ", test_target_data.shape)

[[ 3.      1.     22.      1.      0.      7.25  ]
 [ 1.      0.     38.      1.      0.     71.2833]
 [ 3.      0.     26.      0.      0.      7.925 ]
 ...
 [ 3.      0.     28.      1.      2.     23.45  ]
 [ 1.      1.     26.      0.      0.     30.    ]
 [ 3.      1.     32.      0.      0.      7.75  ]]
test_input_data.shape =  (418, 6) , test_target_data.shape =  (418,)

In [ ]:
정확도 향상을 위한 방법
가족수를 통합
나이를 세분화해서 합치는 방법